#   Licensed to the Apache Software Foundation (ASF) under one or more
#   contributor license agreements.  See the NOTICE file distributed with
#   this work for additional information regarding copyright ownership.
#   The ASF licenses this file to You under the Apache License, Version 2.0
#   (the "License"); you may not use this file except in compliance with
#   the License.  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#   Unless required by applicable law or agreed to in writing, software
#   distributed under the License is distributed on an "AS IS" BASIS,
#   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#   See the License for the specific language governing permissions and
#   limitations under the License.

autoConnectRetry.displayName=\u8a66\u884c\u3092\u7d9a\u3051\u308b
autoConnectRetry.shortDescription=true \u306b\u3059\u308b\u3068\u3001\u30bd\u30b1\u30c3\u30c8\u304c\u78ba\u7acb\u3067\u304d\u306a\u304b\u3063\u305f\u5834\u5408\u306b\u30c9\u30e9\u30a4\u30d0\u30fc\u306f\u540c\u3058\u30b5\u30fc\u30d0\u30fc\u3078\u63a5\u7d9a\u306e\u8a66\u884c\u3092\u7d9a\u3051\u307e\u3059\u3002<br><br>\u518d\u8a66\u884c\u3092\u7d9a\u3051\u308b\u6700\u5927\u6642\u9593\u304c\u5b58\u5728\u3057\u3001\u65e2\u5b9a\u306f 15 \u79d2\u3067\u3059\u3002<br><br>\u30b5\u30fc\u30d0\u30fc\u304c\u4e00\u6642\u7684\u306b\u30c0\u30a6\u30f3\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u64cd\u4f5c\u3092\u5236\u9650\u3059\u308b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u306a\u3044\u3088\u3046\u306b\u3059\u308b\u306e\u306b\u5f79\u7acb\u3061\u307e\u3059\u3002<br><br>\u307e\u305f\u65b0\u3057\u3044\u30de\u30b9\u30bf\u30fc\u3078\u30b9\u30e0\u30fc\u30ba\u306b\u79fb\u884c\u3059\u308b\u306e\u306b\u3082\u5f79\u7acb\u3061\u307e\u3059 (\u65b0\u3057\u3044\u30de\u30b9\u30bf\u30fc\u306f\u518d\u8a66\u884c\u6642\u9593\u5185\u306b\u9078\u629e\u3055\u308c\u307e\u3059)\u3002<br><br>\u3053\u306e\u30d5\u30e9\u30b0\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306e\u6ce8\u610f\:<br>- \u30ec\u30d7\u30ea\u30ab\u30bb\u30c3\u30c8\u306b\u5bfe\u3057\u3066\u306f\u3001\u30c9\u30e9\u30a4\u30d0\u30fc\u306f\u3059\u3050\u306b\u65b0\u3057\u3044\u30de\u30b9\u30bf\u30fc\u3078\u30d5\u30a7\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u3092\u884c\u3046\u4ee3\u308f\u308a\u306b\u3001\u305d\u306e\u6642\u9593\u306b\u53e4\u3044\u30de\u30b9\u30bf\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u8a66\u884c\u3057\u307e\u3059\u3002  -<br> \u3053\u308c\u306f\u30bd\u30b1\u30c3\u30c8\u306e\u8aad\u307f\u53d6\u308a/\u66f8\u304d\u8fbc\u307f\u306e\u64cd\u4f5c\u3067\u306e\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u51e6\u7406\u3059\u308b\u5fc5\u8981\u306e\u3042\u308b\u4f8b\u5916\u306e\u30b9\u30ed\u30fc\u3092\u56de\u907f\u3057\u307e\u305b\u3093\u3002<br><br>\u3053\u306e\u30d5\u30e9\u30b0\u304c false \u3067\u3082\u3001\u81ea\u52d5\u7684\u306b\u5931\u6557\u3057\u305f\u63a5\u7d9a\u3092\u518d\u4f5c\u6210\u3057\u3066\u8aad\u307f\u53d6\u308a\u64cd\u4f5c\u3092\u518d\u8a66\u884c\u3059\u308b\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u30c9\u30e9\u30a4\u30d0\u30fc\u304c\u65e2\u306b\u6301\u3063\u3066\u3044\u307e\u3059\u3002 <br><br>\u65e2\u5b9a\u5024\u306f false \u3067\u3059\u3002
connectTimeout.displayName=\u63a5\u7d9a\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
connectTimeout.shortDescription=\u30df\u30ea\u79d2\u5358\u4f4d\u306e\u63a5\u7d9a\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3067\u3059\u3002<br><br>\u65b0\u3057\u3044\u63a5\u7d9a\u3092 Socket.connect(java.net.SocketAddress, int) \u3067\u78ba\u7acb\u3059\u308b\u5834\u5408\u306b\u306e\u307f\u4f7f\u7528\u3057\u307e\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 0 \u3067\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3057\u3092\u610f\u5473\u3057\u307e\u3059\u3002
connection.displayName=\u30b5\u30fc\u30d0\u30fc\u30a2\u30c9\u30ec\u30b9\u306e\u4e00\u89a7
connection.shortDescription=\u30b5\u30fc\u30d0\u30fc\u30a2\u30c9\u30ec\u30b9\u306e\u4e00\u89a7\u3067\u3059
connectionsPerHost.displayName=\u30db\u30b9\u30c8\u3054\u3068\u306e\u6700\u5927\u63a5\u7d9a\u6570
connectionsPerHost.shortDescription=\u3053\u306e Mongo \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u8a31\u53ef\u3059\u308b\u30db\u30b9\u30c8\u3054\u3068\u306e\u6700\u5927\u63a5\u7d9a\u6570\u3067\u3059\u3002<br><br>\u63a5\u7d9a\u306f\u30a2\u30a4\u30c9\u30eb\u6642\u306b\u30d7\u30fc\u30eb\u3067\u4fdd\u6301\u3055\u308c\u307e\u3059\u3002<br><br>\u30d7\u30fc\u30eb\u3092\u4f7f\u3044\u5207\u308b\u3068\u3001\u63a5\u7d9a\u3092\u5fc5\u8981\u3068\u3059\u308b\u64cd\u4f5c\u306f\u5229\u7528\u53ef\u80fd\u306a\u63a5\u7d9a\u306e\u5f85\u6a5f\u304c\u5236\u9650\u3055\u308c\u307e\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 10 \u3067\u3059\u3002
continueOnInsertError.displayName=\u30a8\u30e9\u30fc\u306e\u307e\u307e\u7d9a\u884c
continueOnInsertError.shortDescription=\u30d0\u30c3\u30c1\u633f\u5165\u3092\u6700\u521d\u306e\u30a8\u30e9\u30fc\u306e\u5f8c\u306b\u7d9a\u884c\u3059\u308b\u304b\u3069\u3046\u304b\u3067\u3059
displayName=MongoDB \u30bd\u30fc\u30b9\u8a2d\u5b9a (DEPRECATED)
fsync.displayName=Fsync
fsync.shortDescription=\u30b0\u30ed\u30fc\u30d0\u30eb\u306a WriteConcern \u306e fsync \u5024\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f false \u3067\u3059\u3002
maxAutoConnectRetryTime.displayName=\u6700\u5927\u518d\u8a66\u884c\u6642\u9593
maxAutoConnectRetryTime.shortDescription=\u540c\u3058\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u518d\u8a66\u884c\u3059\u308b\u30df\u30ea\u79d2\u5358\u4f4d\u306e\u6700\u5927\u6642\u9593\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 0 \u3067\u3001autoConnectRetry \u304c\u30aa\u30f3\u306e\u5834\u5408\u306b\u65e2\u5b9a\u5024\u306e 15 \u79d2\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
maxWaitTime.displayName=\u6700\u5927\u5f85\u6a5f\u6642\u9593
maxWaitTime.shortDescription=\u63a5\u7d9a\u304c\u5229\u7528\u53ef\u80fd\u306b\u306a\u308b\u306e\u3092\u30b9\u30ec\u30c3\u30c9\u304c\u5f85\u6a5f\u3059\u308b\u30df\u30ea\u79d2\u5358\u4f4d\u306e\u6700\u5927\u5f85\u6a5f\u6642\u9593\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 120,000 \u3067\u3059\u3002
mongodb.displayName=MongoDB \u63a5\u7d9a
mongodb.shortDescription=\u63a5\u7d9a\u3092\u8a2d\u5b9a\u3057\u307e\u3059
options.displayName=MongoDB \u30aa\u30d7\u30b7\u30e7\u30f3
options.shortDescription=\u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u5404\u7a2e\u8a2d\u5b9a\u3067\u3059
safe.displayName=Safe
safe.shortDescription=true \u306e\u5834\u5408\u306f\u30c9\u30e9\u30a4\u30d0\u30fc\u304c\u5168\u3066\u306e\u64cd\u4f5c\u306b\u5bfe\u3057\u3066 WriteConcern.SAFE \u306e WriteConcern \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002<br><br>w\u3001wtimeout\u3001fsync \u307e\u305f\u306f j \u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u3001\u3053\u306e\u8a2d\u5b9a\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f false \u3067\u3059\u3002
socketKeepAlive.displayName=\u30bd\u30b1\u30c3\u30c8\u306e\u30ad\u30fc\u30d7\u30a2\u30e9\u30a4\u30d6
socketKeepAlive.shortDescription=\u3053\u306e\u30d5\u30e9\u30b0\u306f\u30d5\u30a1\u30a4\u30a2\u30a6\u30a9\u30fc\u30eb\u3092\u901a\u3057\u3066\u63a5\u7d9a\u3092\u4fdd\u6301\u3059\u308b\u30bd\u30b1\u30c3\u30c8\u306e\u30ad\u30fc\u30d7\u30a2\u30e9\u30a4\u30d6\u3092\u5236\u5fa1\u3057\u307e\u3059 Socket.setKeepAlive(boolean)<br><br>\u65e2\u5b9a\u5024\u306f false \u3067\u3059\u3002
socketTimeout.displayName=\u30bd\u30b1\u30c3\u30c8\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
socketTimeout.shortDescription=\u30bd\u30b1\u30c3\u30c8\u306e\u8aad\u307f\u53d6\u308a\u3068\u66f8\u304d\u8fbc\u307f\u306e\u64cd\u4f5c\u306e I/O \u306b\u4f7f\u7528\u3059\u308b\u30df\u30ea\u79d2\u5358\u4f4d\u306e\u30bd\u30b1\u30c3\u30c8\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3067\u3059 Socket.setSoTimeout(int)<br><br>\u65e2\u5b9a\u5024\u306f 0 \u3067\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3057\u3092\u610f\u5473\u3057\u307e\u3059\u3002 
source.displayName=MongoDB \u30bd\u30fc\u30b9
source.shortDescription=\u30bd\u30fc\u30b9\u3092\u8a2d\u5b9a\u3057\u307e\u3059
threadsAllowedToBlockForConnectionMultiplier.displayName=\u5236\u9650\u306e\u4e57\u6570
threadsAllowedToBlockForConnectionMultiplier.shortDescription=\u3053\u306e\u4e57\u6570\u306f\u3001connectionsPerHost \u306e\u8a2d\u5b9a\u306b\u5bfe\u3057\u3066\u4e57\u3058\u3066\u3001\u30d7\u30fc\u30eb\u304b\u3089\u5229\u7528\u53ef\u80fd\u306b\u306a\u308b\u63a5\u7d9a\u3092\u5f85\u6a5f\u3059\u308b\u6700\u5927\u30b9\u30ec\u30c3\u30c9\u6570\u306b\u306a\u308a\u307e\u3059\u3002<br><br>\u305d\u308c\u3092\u8d85\u3048\u308b\u30b9\u30ec\u30c3\u30c9\u306f\u3059\u3050\u306b\u4f8b\u5916\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002<br><br>\u4f8b\u3048\u3070 connectionsPerHost \u304c 10 \u3067 threadsAllowedToBlockForConnectionMultiplier \u304c 5 \u306e\u5834\u5408\u300150 \u500b\u307e\u3067\u306e\u30b9\u30ec\u30c3\u30c9\u304c\u63a5\u7d9a\u3092\u5f85\u6a5f\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 5 \u3067\u3059\u3002
waitForJournaling.displayName=\u30b8\u30e3\u30fc\u30ca\u30eb\u306e\u5f85\u6a5f
waitForJournaling.shortDescription=\u30b0\u30ed\u30fc\u30d0\u30eb\u306a WriteConcern \u306e j \u5024\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f false \u3067\u3059\u3002
writeConcern.displayName=\u66f8\u304d\u8fbc\u307f\u78ba\u8a8d\u30aa\u30d7\u30b7\u30e7\u30f3
writeConcern.shortDescription=\u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u5404\u7a2e\u8a2d\u5b9a\u3067\u3059
writeOperationNumberOfServers.displayName=\u30b5\u30fc\u30d0\u30fc\u306e\u5f85\u6a5f
writeOperationNumberOfServers.shortDescription=\u30b0\u30ed\u30fc\u30d0\u30fc\u30eb\u306a WriteConcern \u306e w \u5024\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 0 \u3067\u3059\u3002
writeOperationTimeout.displayName=\u5f85\u6a5f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
writeOperationTimeout.shortDescription=\u30b0\u30ed\u30fc\u30d0\u30eb\u306a WriteConcern \u306e wtimeout \u5024\u3067\u3059\u3002<br><br>\u65e2\u5b9a\u5024\u306f 0 \u3067\u3059\u3002
